[M_ClaptrapApprentice MissionDefinition]
MissionName="O Aprendiz de Claptrap"
MissionDescription="Com sua barba e sua varinha mágica empunhada, o Claptrap finalmente decidiu testar seu valor como mago.  Ele precisa que você saia com ele por aí e faça uma cara de assustado enquanto ele dispara fogos de artifício com os dedos ou algo assim."
TurnInDescription="Magia... ou ilusão."
MissionSummary="Testemunhe as incríveis habilidades mágicas do Claptrap."
MissionGiver="Claptrap"
MissionTurnInLocation="Claptrap"
TeaserText="É o momento do Claptrap testar suas habilidades mágicas.  Isso vai ser estranho."

[M_ClaptrapApprentice:FinishOffBrooms MissionObjectiveDefinition]
ProgressMessage="Acabe com as Vassouras"

[M_ClaptrapApprentice:FollowClaptrap MissionObjectiveDefinition]
ProgressMessage="Siga o Claptrap"

[M_ClaptrapApprentice:KillBadAssGiantFireBrooms MissionObjectiveDefinition]
ProgressMessage="Elimine as Vassouras Flamjantes Gigantes Encrenqueiras"

[M_ClaptrapApprentice:KillBrooms MissionObjectiveDefinition]
ProgressMessage="Destrua as Vassouras"

[M_ClaptrapApprentice:KillFireBrooms MissionObjectiveDefinition]
ProgressMessage="Elimine as Vassouras Flamejantes"

[M_ClaptrapApprentice:KillGiantFireBrooms MissionObjectiveDefinition]
ProgressMessage="Elimine as Vassouras Flamejantes Gigantes"

[M_ClaptrapApprentice:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ClaptrapApprentice:ObjSet_FinishOffBrooms MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ClaptrapApprentice:ObjSet_FollowClaptrap MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ClaptrapApprentice:ObjSet_KillBadAssGiantFireBrooms MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ClaptrapApprentice:ObjSet_KillBrooms MissionObjectiveSetDefinition]
MissionSummaryOverride="Derrote as vassouras conjuradas."
MissionDescriptionOverride="Com sua barba e sua varinha mágica empunhada, o Claptrap finalmente decidiu testar seu valor como mago.\nO Claptrap tentou invocar um demônio gigante para lutar com ele mas, como ele é mais inútil que mangas num colete, acidentalmente ele invocou algumas vassouras inteligentes.\nÉ melhor você dar um jeito nelas."

[M_ClaptrapApprentice:ObjSet_KillFireBrooms MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ClaptrapApprentice:ObjSet_KillGiantFireBrooms MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ClaptrapApprentice:WitnessMagic MissionObjectiveDefinition]
ProgressMessage="Testemunhe a magia"

